Ran Plan for dir: `eu-central-1/staging` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_iam_access_key.airflow_dev_secret_key will be created
+ resource "aws_iam_access_key" "airflow_dev_secret_key" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "airflow-dev-user"
    }

  # aws_iam_policy.staging_bucket_rw will be created
+ resource "aws_iam_policy" "staging_bucket_rw" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "staging-bucket-read-write"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_user.airflow-dev-user will be created
+ resource "aws_iam_user" "airflow-dev-user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "airflow-dev-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.attach_policy will be created
+ resource "aws_iam_user_policy_attachment" "attach_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "airflow-dev-user"
    }

  # aws_s3_bucket.adhoc_bucket will be created
+ resource "aws_s3_bucket" "adhoc_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "staging-federated-engineers-adhoc"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-central-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "environment" = "staging"
          + "team"        = "Data-Platform-Team"
          + "terraform"   = "true"
        }
      + tags_all                    = {
          + "environment" = "staging"
          + "team"        = "Data-Platform-Team"
          + "terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.example will be destroyed
  # (because aws_s3_bucket.example is not in configuration)
- resource "aws_s3_bucket" "example" {
      - arn                         = "arn:aws:s3:::staging-federated-engineers-adhoc" -> null
      - bucket                      = "staging-federated-engineers-adhoc" -> null
      - bucket_domain_name          = "staging-federated-engineers-adhoc.s3.amazonaws.com" -> null
      - bucket_region               = "eu-central-1" -> null
      - bucket_regional_domain_name = "staging-federated-engineers-adhoc.s3.eu-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z21DNDUVLTQW6Q" -> null
      - id                          = "staging-federated-engineers-adhoc" -> null
      - object_lock_enabled         = false -> null
      - region                      = "eu-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "environment" = "staging"
          - "team"        = "Data-Platform-Team"
          - "terraform"   = "true"
        } -> null
      - tags_all                    = {
          - "environment" = "staging"
          - "team"        = "Data-Platform-Team"
          - "terraform"   = "true"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "ecebfd11fd1e9f7b2cbdf00b94de40aa6833a8888861060e36f0dd794e116f7c" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_ssm_parameter.staging_access_key will be created
+ resource "aws_ssm_parameter" "staging_access_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/airflow-dev/aws-access-key"
      + region         = "eu-central-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.staging_secret_key will be created
+ resource "aws_ssm_parameter" "staging_secret_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/airflow-dev/aws-secret-key"
      + region         = "eu-central-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 7 to add, 0 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d eu-central-1/staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://161.97.80.18:4141/lock?id=Federated-Engineers%252Fcloud-infrastructures%252Feu-central-1%252Fstaging%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d eu-central-1/staging
  ```
Plan: 7 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```